package com.xxl.intelligent.manager;

import org.springframework.boot.test.context.SpringBootTest;

/**
 * @Author: xxl
 * @Date: 2025/2/4 22:35
 */
@SpringBootTest
public class BailianManagerTest {

    public static void main(String[] args) {
        String answer = "分析需求：\n" +
                "分析网站用户的增长情况\n" +
                "原始数据：\n" +
                "日期,用户数\n" +
                "1号,10\n" +
                "2号,20\n" +
                "3号,30\n";

        String answer2 = "分析需求：\n" +
                "分析各职称人数\n" +
                "原始数据：\n" +
                "姓名,手机号码,工号,职称,职务/角色,科室/病区,邮箱,备注,备注：\n" +
                "马督工1,99901001111,A00001,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@126.con\n" +
                "马督工2,99901001112,A00002,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@127.con\n" +
                "马督工3,99901001113,A00003,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@128.con\n" +
                "马督工4,99901001114,A00004,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@129.con\n" +
                "马督工5,99901001115,A00005,教授/助教,教研室秘书,呼吸与危重症医学科（市北）,23123@130.con\n" +
                "马督工6,99901001116,A00006,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@131.con\n" +
                "马督工7,99901001117,A00007,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@132.con\n" +
                "马督工8,99901001118,A00008,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@133.con\n" +
                "马督工9,99901001119,A00009,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@134.con\n" +
                "马督工10,99901001120,A00010,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@135.con\n" +
                "马督工11,99901001121,A00011,教授/副教授,教研室秘书,呼吸与危重症医学科（市北）,23123@136.con";
        try {
//            BailianManager.appCall(answer);
            System.out.println(answer2);
            System.out.println(BailianManager.appCallSynch(answer2));
        } catch (Exception e) {
            e.printStackTrace();
        }
    }
}
